package homeworks.module2part1.task2;

/**
 * Задание 3:
 * Составить программу вывода на экран 9 чисел столбиком (не используя пробелы):
 * 3	67	9
 * 67	6	50
 * 4	80	6
 */
public class OutputDigits {
    public static void main(String[] args) {
        System.out.println("3\t67\t9\n67\t6\t50\n4\t80\t6");
    }
}

