//package independentWork.work1.methods.task2.two;
//
///**
// * Created by ivko on 19.12.17.
// */
//public enum Hungreds {
//    Сто, Двести, Триста, Четыреста, Пятьсот, Шестьсот, Семьсот, Восемьсот, Девятьсот
//
//}
//
//public enum Tens {
//    двадцать, тридцать, сорок, пятьдесят, шестьдесят, семьдесят, восемьдесят, девяносто
//}
//
//public enum Ones {
//    один, два, три, четыре, пять, шесть, семь, восемь, девять
//}
//
//public enum Dozens {
//    десять, одиннадцать, двенадцать, тринадцать, четырнадцать, пятнадцать, шестнадцать, семнадцать, восемнадцать, девятнадцать
//}
