package classworks.march2018.mar132018.homework.task3;

/**
 * Создать класс Отец и класс Сын. Унаследовать Сына от Отца. У обоих должен быть метод спать, но это не должно быть
 * переопределение метода.
 */
class Father {
    public void sleep() {
        System.out.println(" ZZzzz.....");
    }
}