package classworks.may2018.may162018.homework.task1;

/**
 * Напишите класс, реализующий интерфейс Runnable, метод run() которого считывает из файла на жестком диске и выводит в
 * указанный поток какие-либо данные.
 * Для вывода каждой "порции" данных должно использоваться несколько операций вывода. Операции вывода должны быть разделены
 * вызовами sleep(100).
 * Запустите 10 экземпляров этого класса в разных потоках так, чтобы они выводили данные в один и тот же поток вывода.
 * Вывод информации должен быть синхронизирован так, чтобы в результирующем выходном потоке порции данных не "перемешивались".
 * Осуществите запись данных из общего потока в отдельный файл на жестком диске (или в самом проекте, как мы делали).
 */
public class RunnerClass {
}
