package classworks.dec282017.ifElseConstructions.task1;

/**
 * 1.Даны два числа. Найти их сумму, разность, произведение, а так же частное от деления первого числа на второе.
 */
public class TwoVariables {
    public static void main(String[] args) {
        int a = 9;
        int b = 23;
        System.out.println(a + b);
        System.out.println(a - b);
        System.out.println(a * b);
        System.out.println((double) a / b);
    }
}
